; domain
(define (domain sailor)

    (:requirements :strips)

    (:predicates
        (place ?place)
        (sailor ?sailor)
        (at ?where ?who)
        (path ?from ?to)
        (seapath ?from ?to)
        (atplacecan ?where ?act)
        (hasship)
        (hasfrigate)
        (hascaravels)
        (hasalkohol)
        (hasdoubtfulmeet)
        (hasflower)
        (hasbearleather)
        (hasmap)
        (hasgoldgroats)
        (hasgoldcoin)
        (hasgoldbrick)
        (hascriminalrecord)
        (hasalkomood)
        (hasintoxication)
        (hasdependence)
        (hasgoodconnect)
        (hasexperienceinfight)
        (hastree)
        (haspearl)
        (haswinpirates)
        (haswinbear)
        (hascoconuts)
        (hascocaine)
        (iscapitan)
        (hasdazzlegirl)
        (hasmeetsmuggler)
        (hashappiness)
        
    
    )


     (:action move
        :parameters (?who ?from ?to)
        :precondition (and (at ?from ?who) (path ?from ?to))
        :effect (and (at ?to ?who) (not (at ?from ?who)))
    )
    
    (:action sail
        :parameters (?who ?from ?to)
        :precondition (and (at ?from ?who)(seapath ?from ?to)(hasship))
        :effect (and (at ?to ?who) (not (at ?from ?who)))
    )
    
    (:action drunk1
        :precondition(and(hasalkohol)(not(hasintoxication))(not(hasalkomood)))
        :effect (and(hasalkomood)(not(hasalkohol)))
    )
    
    (:action drunk2
        :precondition(and(hasalkohol)(not(hasintoxication))(hasalkomood))
        :effect (and(hasintoxication)(not(hasalkohol)))
    )
    
    (:action drunk3
        :precondition(and(hasalkohol)(hasintoxication)(hasalkomood))
        :effect (and(hasdependence)(not(hasalkohol)))
    )
    
    (:action ship
        :precondition(and(hastree))
        :effect (and(hasship)(not(hastree)))
    )
    
    (:action frigate
        :precondition(and(hastree)(hasship)(hasgoldgroats))
        :effect (and(hasfrigate)(not(hasgoldgroats))(not(hastree)))
    )
    
    (:action frigate
        :precondition(and(hastree)(hasship)(hasgoldcoin))
        :effect (and(hascaravels)(not(hasgoldcoin))(not(hastree)))
    )
    
    
    (:action cutwood
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where cutwood))
        :effect (hastree)
    )
    
    (:action makeship
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where makeship)(hastree))
        :effect (hasship)
    )
    
    (:action pickflowers
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where pickflowers))
        :effect (hasflower)
    )
    
    (:action fightbear
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where fightbear))
        :effect (and(hasbearleather)(hasexperienceinfight)(haswinbear))
    )
    
    (:action meetmap
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where meetmap)(hasalkohol))
        :effect (and(hasmap)(not(hasalkohol))(hasdoubtfulmeet))
    )
    
    (:action stealship
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where stealship))
        :effect (and(hasship)(hascriminalrecord))
    )
    
    (:action pangold
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where pangold))
        :effect (and(hasgoldgroats))
    )
    
    (:action sober
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where sober))
        :effect (and(not(hasintoxication))(not(hasalkomood)))
    )
    
    (:action buyalko
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where buyalko)(hasgoldgroats))
        :effect (and(hasalkohol)(not(hasgoldgroats)))
    )
    
    (:action buyconnect
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where buyconnect)(hasgoldgroats))
        :effect (and(hasgoodconnect)(not(hasgoldgroats)))
    )
    
    (:action hardeninbattle
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where hardeninbattle)(hasalkomood))
        :effect (and(hasexperienceinfight))
    )
    
    (:action accumulate
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where accumulate)(hasgoldgroats))
        :effect (and(hasgoodconnect)(not(hasgoldgroats))(hasgoldcoin))
    )
    
    (:action invest
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where invest)(hasgoldcoin))
        :effect (and(hasgoodconnect)(not(hasgoldcoin))(hasgoldbrick))
    )
    
    (:action salecoconuts
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where salecoconuts)(hascoconuts))
        :effect (and(hasgoldcoin)(not(hascoconuts)))
    )
    
    (:action salebear
    :parameters (?where ?who)
    :precondition (and(at ?where ?who)(atplacecan ?where salecoconuts)(hasbearleather))
    :effect (and(hasgoldcoin)(not(hasbearleather)))
    )
    
    (:action work
    :parameters (?where ?who)
    :precondition (and(at ?where ?who)(atplacecan ?where work))
    :effect (and(hasgoldgroats))
    )
    
`   (:action meetsmuggler
    :parameters (?where ?who)
    :precondition (and(at ?where ?who)(atplacecan ?where meetsmuggler)(hasdoubtfulmeet)(hasgoldbrick))
    :effect (and(hasmeetsmuggler))
    )
    
    (:action stealmoney
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where stealmoney))
        :effect (and(hasgoldcoin)(hascriminalrecord))
    )
    
    
    (:action buyindulgence
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where buyindulgence)(hasgoldgroats))
        :effect (and(not(hasgoldgroats))(not(hascriminalrecord)))
    )
    
    (:action drunkcity
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where drunkcity))
        :effect (and(hasalkomood))
    )
    
    (:action study
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where study)(hasgoldcoin)(not(hascriminalrecord)))
        :effect (and(not(hasgoldcoin))(iscapitan))
    )
    
    (:action losingpirates
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where losingpirates)(not(hasexperienceinfight)))
        :effect (and(not(hasgoldcoin))(not(hasgoldgroats))(not(hasgoldbrick))(not(hascaravels))(not(hasfrigate)))
    )
    
    (:action joinpirates
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where joinpirates)(hasexperienceinfight))
        :effect (and(hasalkomood))
    )
    
    (:action winpirates
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where winpirates)(hasexperienceinfight)(hascaravels))
        :effect (and(hasgoldgroats)(hasgoldbrick)(hasgoldcoin)(hasship)(hasfrigate)(hascaravels)(haswinpirates))
    )
    
    (:action sinkforpearl
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where sinkforpearl))
        :effect (and(haspearl))
    )
    
    (:action dazzlegirl
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where dazzlegirl)(or(haswinpirates)(haswinbear)(iscapitan)))
        :effect (and(hasdazzlegirl))
    )
    
    (:action collectcoconuts
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where collectcoconuts))
        :effect (and(hascoconuts))
    )
    
    (:action findcocaine
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(atplacecan ?where findcocaine)(hasmap))
        :effect (and(hascocaine))
    )

    
    (:action goal_marry
        :parameters (?where ?who)
        :precondition (and (at ?where ?who)(hasdazzlegirl)(hasgoldbrick)(haspearl)(hasflower)(hasgoodconnect)(not(hascriminalrecord))(at island sailor)(not(hasintoxication))(not(hasdependence)))
        :effect (and(hashappiness))
    
    )
    
     (:action goal_cocaine
        :parameters (?where ?who)
        :precondition (and(at ?where ?who)(hascocaine)(hasdependence)(hasmeetsmuggler)(hasgoldbrick)(hasfrigate))
        :effect (and(hashappiness))
    )
    
    (:action goal_admiral
        :parameters (?where ?who)
        :precondition (and (at ?where ?who)(iscapitan)(haswinpirates)(at academy sailor)(not(hasintoxication)))
        :effect (and(hashappiness))
    )
     
    
    
    
    
)

; problem
(define (problem FindHappiness)
    (:domain sailor)
    (:requirements :strips)
    (:objects sailor ship 
            port forest river pub academy city sea island beacon
            cutwood makeship pickflowers fightbear meetmap 
            stealship pangold sober
            work salebear salecoconuts meetsmuggler
            buyalko buyconnect hardeninbattle
            accumulate invest stealmoney buyindulgence drunkcity 
            study
            losingpirates joinpirates winpirates sinkforpearl
            dazzlegirl
            collectcoconuts findcocaine
            goal_marry goal_admiral goal_cocaine
            
    )
    
    
    (:init
        (place port)
        (place forest)
        (place river)
        (place pub)
        (place academy)
        (place city)
        (place sea)
        (place island)
        (place beacon)
        (path forest river)
        (path river forest)
        (path river port)
        (path port river)
        (path port pub)
        (path pub port)
        (path port city)
        (path city port)
        (path city academy)
        (path academy city)
        
        (seapath port sea)
        (seapath sea port)
        (seapath sea island)
        (seapath island sea)
        (seapath sea beacon)
        (seapath beacon sea)
        (seapath port beacon)
        (seapath beacon port)
        
        (atplacecan forest cutwood)
        (atplacecan forest makeship)
        (atplacecan forest pickflowers)
        (atplacecan forest fightbear)
        (atplacecan forest meetmap)
        
        (atplacecan river stealship)
        (atplacecan river pangold)
        (atplacecan river sober)
        
        (atplacecan port work)
        (atplacecan port salecoconuts)
        (atplacecan port salebear)
        (atplacecan port meetsmuggler)
        
        (atplacecan pub buyalko)
        (atplacecan pub buyconnect)
        (atplacecan pub hardeninbattle)
        
        (atplacecan city accumulate)
        (atplacecan city invest)
        (atplacecan city stealmoney)
        (atplacecan city buyindulgence)
        (atplacecan city drunkcity)
        
        (atplacecan academy study)
        
        (atplacecan sea losingpirates)
        (atplacecan sea joinpirates)
        (atplacecan sea winpirates)
        ;(atplacecan sea sinkforpearl)
        (atplacecan sea sober)
        
        (atplacecan beacon dazzlegirl)
        
        (atplacecan island cutwood)
        (atplacecan island collectcoconuts)
        (atplacecan island findcocaine)
        
        (sailor sailor)
        (at port sailor)
    )
    
    (:goal (and(hashappiness)))
    
    ;(:goal (and (hasdazzlegirl)(hasgoldbrick)(haspearl)(hasflower)(hasgoodconnect)(not(hascriminalrecord))(at island sailor)(not(hasintoxication))(not(hasdependence))))
    
    ;(:goal (and(hascocaine)(hasdependence)(hasmeetsmuggler)(hasgoldbrick)(hasfrigate)))
    
    ;(:goal (and (iscapitan)(haswinpirates)(at academy sailor)(not(hasintoxication))))
    

)

; plan
1. (move sailor port river)
   deleted: (at port sailor)
   added: (at river sailor)
   goals met: 0 of 1
2. (move sailor river forest)
   deleted: (at river sailor)
   added: (at forest sailor)
   goals met: 0 of 1
3. (fightbear forest sailor)
   added: (hasbearleather) (hasexperienceinfight) (haswinbear)
   goals met: 0 of 1
4. (move sailor forest river)
   deleted: (at forest sailor)
   added: (at river sailor)
   goals met: 0 of 1
5. (move sailor river port)
   deleted: (at river sailor)
   added: (at port sailor)
   goals met: 0 of 1
6. (salebear port sailor)
   deleted: (hasbearleather)
   added: (hasgoldcoin)
   goals met: 0 of 1
7. (move sailor port river)
   deleted: (at port sailor)
   added: (at river sailor)
   goals met: 0 of 1
8. (move sailor river forest)
   deleted: (at river sailor)
   added: (at forest sailor)
   goals met: 0 of 1
9. (cutwood forest sailor)
   added: (hastree)
   goals met: 0 of 1
10. (makeship forest sailor)
   added: (hasship)
   goals met: 0 of 1
11. (move sailor forest river)
   deleted: (at forest sailor)
   added: (at river sailor)
   goals met: 0 of 1
12. (move sailor river port)
   deleted: (at river sailor)
   added: (at port sailor)
   goals met: 0 of 1
13. (move sailor port city)
   deleted: (at port sailor)
   added: (at city sailor)
   goals met: 0 of 1
14. (move sailor city academy)
   deleted: (at city sailor)
   added: (at academy sailor)
   goals met: 0 of 1
15. (study academy sailor)
   deleted: (hasgoldcoin)
   added: (iscapitan)
   goals met: 0 of 1
16. (move sailor academy city)
   deleted: (at academy sailor)
   added: (at city sailor)
   goals met: 0 of 1
17. (stealmoney city sailor)
   added: (hasgoldcoin) (hascriminalrecord)
   goals met: 0 of 1
18. (frigate)
   deleted: (hasgoldcoin) (hastree)
   added: (hascaravels)
   goals met: 0 of 1
19. (move sailor city port)
   deleted: (at city sailor)
   added: (at port sailor)
   goals met: 0 of 1
20. (sail sailor port sea)
   deleted: (at port sailor)
   added: (at sea sailor)
   goals met: 0 of 1
21. (winpirates sea sailor)
   added: (hasgoldgroats) (hasgoldbrick) (hasgoldcoin) (hasfrigate) (haswinpirates)
   goals met: 0 of 1
22. (sail sailor sea port)
   deleted: (at sea sailor)
   added: (at port sailor)
   goals met: 0 of 1
23. (move sailor port city)
   deleted: (at port sailor)
   added: (at city sailor)
   goals met: 0 of 1
24. (move sailor city academy)
   deleted: (at city sailor)
   added: (at academy sailor)
   goals met: 0 of 1
25. (goal_admiral academy sailor)
   added: (hashappiness)
   goals met: 1 of 1
